# ------------------------------------------------------------------------------
# 偽ターゲット (ファイルを作らないで実行するタスクの宣言)
# ------------------------------------------------------------------------------
.PHONY: taskA \
	      taskB
.PHONY: taskC

# ------------------------------------------------------------------------------
# Task
# ------------------------------------------------------------------------------

# make
task-default:
	# NOTE: インデントは、基本的にtabで指定する
	@echo "引数がないと最初のタスクが実行されます。"

# make taskA
taskA:
	@echo 'Starting $@'
	@echo A
	@echo 'Finished $@'

# make taskB
taskB:
	@echo 'Starting $@'
	@echo B
	@echo 'Finished $@'

# make taskC
# タスクをネストして実行
#   => コマンド実行時に -j を使うと、逐次実行から並列実行に切り替えられる。
#      -j  -> CPU数に基づいて並列実行数を自動決定
#      -j2 -> 最大2つのジョブを同時実行
#      -j4 -> 最大4つのジョブを同時実行
taskC: taskA taskB
	@echo 'Starting $@'
	@echo C
	@echo 'Finished $@'
